# run "brew bundle" to install
# xcode-select --install

# specify a directory to install
cask_args appdir: '/Applications'

# Install and manage GUI macOS applications
tap 'homebrew/cask'
# Integrates Homebrew formulae with macOS' `launchctl` manager
tap 'homebrew/services'
tap "homebrew/bundle"
tap "homebrew/core"

# Brew extensions and helper
brew 'cask' # Install OS X applications
brew 'mas'  # Install applications from Mac App Store

# Image manipulation library
brew 'libjpg'
brew 'libpng'
brew "make"

# SSL/TLS cryptography library
brew 'openssl'

brew 'nmap'
brew "htop"

brew 'nginx'
brew 'node'

brew "python"
brew "haskell-stack"

# Clone of cat with syntax highlighting and Git integration
brew 'bat'
brew 'ssh-copy-id'
brew 'pyenv'


cask 'docker-toolbox'
cask "java"
cask "spotify"

brew 'postgres'
brew 'postgresql'
cask 'postgres'


# Browsers
cask "google-chrome"

# Editors
brew "nano"
# brew 'vim'

# cask 'sublime-text'
# cask 'atom'
cask 'visual-studio-code'

# Daily helper
brew "wget"
brew 'coreutils'
brew 'curl'


# Version Control
brew 'git'
cask 'github'
# brew "github-keygen"
cask 'sourcetree'


# Shells
brew "zsh"
brew "bash"
brew "bash-completion"